app/controllers/orders_controller.rb

  def create
    user = User.find_or_create_by_stripe_customer_id(params[:stripe_customer_id])

    @order = Order.new(:name => params[:name], :address1 => params[:address1], :city => params[:city], :state => params[:state], :zip => params[:zip], :country => params[:country])
    @order.save!
    @order.items.create!(:sku => params[:sku], :quantity => params[:quantity])
---
INSERT INTO `users` (`created_at`, `stripe_customer_id`, `updated_at`) VALUES ('2012-11-06 20:28:17', 'cus_0gHnMDwAYXZhkz', '2012-11-06 20:28:17')
SELECT `users`.* FROM `users` WHERE `users`.`stripe_customer_id` = 'cus_0gCrWfFez2jAMy' LIMIT 1
INSERT INTO `orders` (`address1`, `address2`, `city`, `country`, `created_at`, `email`, `name`, `phone`, `state`, `stripe_customer_id`, `updated_at`, `user_id`, `zip`) VALUES ('fdsfs', NULL, NULL, NULL, '2012-11-05 15:17:23', NULL, 'sfsdfsd', NULL, NULL, NULL, '2012-11-05 15:17:23', NULL, NULL)
INSERT INTO `items` (`order_id`, `quantity`, `sku`) VALUES (5, 2, 'PREMIUM')